In [19]:
import pandas as pd
df=pd.read_csv(r"C:\Users\nk424\OneDrive\Scans\Desktop\training\Sample_Data\Customer Purchase.csv")
df.head()

   Age  Gender Education   Review Purchased
0   30  Female    School  Average        No
1   68  Female        UG     Poor        No
2   70  Female        PG     Good        No
3   72  Female        PG     Good        No
4   16  Female        UG  Average        No

In [3]:
df.isnull().sum()

Age          0
Gender       0
Education    0
Review       0
Purchased    0
dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Age        50 non-null     int64
 1   Gender     50 non-null     object
 2   Education  50 non-null     object
 3   Review     50 non-null     object
 4   Purchased  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [7]:
# converting categorical into numerical
df['Review'].value_counts()

Review
Poor       18
Good       18
Average    14
Name: count, dtype: int64

In [8]:
df['Education'].value_counts()

Education
PG        18
School    16
UG        16
Name: count, dtype: int64

In [10]:
# seprating ordinal 
df1=df.iloc[:,2:4]
df1.head()

  Education   Review
0    School  Average
1        UG     Poor
2        PG     Good
3        PG     Good
4        UG  Average

In [11]:
# implementing ordinal encoding on df1
from sklearn.preprocessing import OrdinalEncoder
OE=OrdinalEncoder(categories=[['School','UG','PG'],['Poor','Average','Good']])

In [13]:
df1_OE=OE.fit_transform(df1)
df1_OE

array([[0., 1.],
       [1., 0.],
       [2., 2.],
       [2., 2.],
       [1., 1.],
       [0., 1.],
       [0., 2.],
       [0., 0.],
       [1., 1.],
       [1., 2.],
       [1., 2.],
       [1., 2.],
       [0., 0.],
       [0., 1.],
       [2., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 2.],
       [2., 0.],
       [0., 1.],
       [2., 1.],
       [2., 0.],
       [0., 2.],
       [2., 1.],
       [0., 2.],
       [2., 0.],
       [2., 0.],
       [0., 0.],
       [1., 1.],
       [1., 1.],
       [0., 0.],
       [1., 1.],
       [2., 2.],
       [0., 1.],
       [0., 0.],
       [1., 2.],
       [2., 1.],
       [0., 2.],
       [2., 0.],
       [0., 2.],
       [2., 2.],
       [2., 2.],
       [2., 0.],
       [1., 1.],
       [2., 0.],
       [2., 0.],
       [2., 2.],
       [1., 2.],
       [1., 2.]])

In [14]:
df1=pd.DataFrame(df1_OE,columns=['Education','Review'])
df1.head()

   Education  Review
0        0.0     1.0
1        1.0     0.0
2        2.0     2.0
3        2.0     2.0
4        1.0     1.0

In [18]:
# astpye
df1=df1.astype(int)
df1.head()

   Education  Review
0          0       1
1          1       0
2          2       2
3          2       2
4          1       1

In [20]:
df2=df[['Gender','Purchased']]
df2.head()

   Gender Purchased
0  Female        No
1  Female        No
2  Female        No
3  Female        No
4  Female        No

In [23]:
# lets apply dummy variable in nominal categorical
dummy_df=pd.get_dummies(df2)
dummy_df.head()

   Gender_Female  Gender_Male  Purchased_No  Purchased_Yes
0           True        False          True          False
1           True        False          True          False
2           True        False          True          False
3           True        False          True          False
4           True        False          True          False

In [ ]:
dummy_df=dummy_df.astype(int)
dummy_df.head()
# dummy_df.shape
# df1.shape

(50, 2)

In [30]:
# lets apply one hot encoder
from sklearn.preprocessing import OneHotEncoder
ohe=OneHotEncoder(sparse_output=False)

In [ ]:
df2_ohe=ohe.fit_transform(df2)
df2_ohe
# df2.shape
# df2_ohe.shape

(50, 4)

In [ ]:
df2_ohe=OneHotEncoder(sparse_output=False,drop='first')# it converted 4 columns into 2 columns

In [38]:
oh_enc_arr=df2_ohe.fit_transform(df2)
oh_enc_arr

array([[0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 0.],
       [1., 1.],
       [0., 1.],
       [1., 1.],
       [1., 0.],
       [0., 0.],
       [1., 1.],
       [1., 0.],
       [1., 1.],
       [0., 1.],
       [1., 0.],
       [1., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 0.],
       [0., 1.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 1.],
       [0., 1.],
       [1., 0.],
       [1., 1.],
       [0., 1.],
       [1., 1.],
       [0., 0.],
       [1., 0.],
       [1., 0.],
       [1., 1.],
       [0., 1.],
       [1., 0.],
       [0., 0.],
       [1., 1.],
       [0., 0.],
       [0., 1.],
       [0., 1.],
       [0., 0.]])

In [41]:
df2=pd.DataFrame(oh_enc_arr,columns=['Gender','Purchased'])
df2=df2.astype(int)
df2.head()

   Gender  Purchased
0       0          0
1       0          0
2       0          0
3       0          0
4       0          0